lib/tasks/fleet_sim.rake

INSERT INTO "notes" ("title", "body", "status", "created_at", "updated_at", "user_id", "score", "machine_name", "machine_location", "machine_model", "operating_hours") VALUES ('Oil leak detected - Cat 336', 'fluid visible near lower engine compartment', 'In Progress', '2026-04-27 01:31:30.814399', '2026-04-27 01:31:30.814399', NULL, 0, 'Excavator 955', 'West Pit', 'Cat 336', 10230) RETURNING "id"
---
      fault_title, fault_body = faults.sample
      machine_number = rand(100..999)

      Note.create!(
        title: "#{fault_title} - #{model}",
        body: fault_body,
        status: ["Open", "In Progress", "Completed"].sample,
        machine_name: "#{type} #{machine_number}",
        machine_model: model,
        machine_location: sites.sample,
        operating_hours: rand(250..12_500)
      )