app/views/notes/_form.html.erb

SELECT "users".* FROM "users"
---
    <%= form.label :user %>
    <%= form.collection_select :user_id, User.all, :id, :name %>