app/views/notes/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."note_id" = 1
---

<% @note.comments.each do |comment| %>