app/controllers/api/insights_controller.rb

SELECT "notes".* FROM "notes"
SELECT COUNT(*) FROM "notes" WHERE "notes"."status" != 'Completed'
SELECT COUNT(*) AS "count_all", "notes"."machine_location" AS "notes_machine_location" FROM "notes" GROUP BY "notes"."machine_location"
---
  def index
    notes = Note.all

    render json: {
      totals: {
        total: notes.count,
        open: notes.where.not(status: "Completed").count,
        completed: notes.where(status: "Completed").count,
        high_priority: notes.where("score >= 30").count
      },
      breakdowns: {
        by_model: notes.group(:machine_model).count,
        by_location: notes.group(:machine_location).count,
        by_status: notes.group(:status).count