app/controllers/api/notes_controller.rb

  def serialize_note(note)
    {
      id: note.id,
      title: note.title,
      body: note.body,
      status: note.status,
      score: note.score,
      user: note.user ? {
        id: note.user.id,
        name: note.user.name
      } : nil,
      comments: note.comments.map do |comment|
---
SELECT "comments".* FROM "comments" WHERE "comments"."note_id" = 4