app/controllers/api/notes_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."note_id" IN (1, 2, 3)
SELECT "notes".* FROM "notes"
---
  def index
    notes = Note.includes(:user, :comments).all

    render json: notes.map { |note| serialize_note(note) }

SELECT "users".* FROM "users" WHERE "users"."id" = 1
---
  def show
    note = Note.includes(:user, :comments).find(params.expect(:id))

INSERT INTO "notes" ("title", "body", "status", "created_at", "updated_at", "user_id", "score") VALUES ('Test agajn', 'Still trying to delete this message ', 'Pending', '2026-04-26 23:35:29.930248', '2026-04-26 23:35:29.930248', NULL, 0) RETURNING "id"
---
  def create
    note = Note.new(note_params)

    if note.save

SELECT "notes".* FROM "notes" WHERE "notes"."id" = 1 LIMIT 1
UPDATE "notes" SET "body" = 'This is urgent fix immediatelyy', "updated_at" = '2026-04-26 23:38:37.897974' WHERE "notes"."id" = 2
---
  def update
    note = Note.find(params[:id])
    if note.update(note_params)

SELECT "notes".* FROM "notes" WHERE "notes"."id" = 4 LIMIT 1
DELETE FROM "notes" WHERE "notes"."id" = 4
---
  def destroy
    note = Note.find(params.expect(:id))
    note.destroy

SELECT "comments".* FROM "comments" WHERE "comments"."note_id" = 2
---
  def serialize_note(note)
    {
      id: note.id,
      title: note.title,
      body: note.body,
      status: note.status,
      score: note.score,
      user: note.user ? {
        id: note.user.id,
        name: note.user.name
      } : nil,
      comments: note.comments.map do |comment|