app/controllers/notes_controller.rb

  def completed
    @notes = Note.where(status: "Done")
---
SELECT "notes".* FROM "notes" WHERE "notes"."status" = 'Done'

  def create
    @note = Note.new(note_params)
    if @note.save
---
INSERT INTO "notes" ("title", "body", "status", "created_at", "updated_at", "user_id") VALUES ('Example note ', 'This is the text body of an example.Note', '', '2026-04-26 19:31:39.611128', '2026-04-26 19:31:39.611128', 856856) RETURNING "id"

  def set_note
    @note = Note.find(params.expect(:id))
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = 3 LIMIT 1